etpos/files/store.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="https://vendorapi.etpos.lk/soap/merchant/server">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:createStore>
            <name>{name}</name>
            <contactno>{contactno}</contactno>
            <email>{email}</email>
            <fax>{fax}</fax>
            <locationType>{locationType}</locationType>
            <userid>{userid}</userid>
            <businessCategories>
                <category>{category1}</category>
                <category>{category2}</category>
            </businessCategories>
            <address>
                <!--You may enter the following 6 items in any order-->
                <addressLine1>{addressLine1}</addressLine1>
                <city>{city}</city>
                <country>{country}</country>
                <addressLine2>{addressLine2}</addressLine2>
                <state>{state}</state>
                <postalCode>{postalCode}</postalCode>
            </address>
        </ser:createStore>
    </soapenv:Body>
</soapenv:Envelope>
